; domain
(define (domain grid_overcooked)
(:requirements :adl :strips :typing )
(:types cell
 agent
  object)
  ; cell is a type for the grid cells
  ; agent is a type for the agent that performs actions
  ; object is a type for the objects in the environment (e.g., tomato, lettuce, plate)


(:predicates
  (agent_at ?a - agent ?c - cell)
  (holding  ?a - agent ?o - object)
  (object_at ?o - object ?c - cell)
  (is_cutting_board ?c - cell)
  (delivery_spot ?c - cell)
  (occupied ?c - cell)
  (adjacent ?c1 - cell ?c2 - cell)
  (is_floor ?c - cell)
  (holding_nothing ?a - agent)
  (tomato ?o - object)
  (lettuce ?o - object)
  (plate ?o - object)
  (chopped ?o - object)
  (delivered ?o - object)
)

; when agent moves how to make sure everything they carry moves?'
; can carry tomato, lettuce, plate, chopped lettuce, chopped tomato, chopped lettuce on a plate, chopped tomato on a plate
; can carry salad on place, salad

(:action move
  :parameters (?a - agent ?start - cell ?end - cell)
  :precondition (and
  (agent_at ?a ?start)
  (adjacent ?start ?end)
  (is_floor ?end)
  (not (occupied ?end)) ; cannot move to an occupied cell
  )
  :effect (and
  (not (agent_at ?a ?start))
  (agent_at ?a ?end)
  (occupied ?end) ; mark the new cell as occupied
  (not (occupied ?start)) ; mark the old cell as not occupied
  )
)


; --------------------------------------------------------------------------------------------------------------------

; when chopping items are being held


(:action chop
    :parameters (?a - agent ?agent_loc - cell ?cut-board_loc - cell ?obj - object)
    :precondition (and
        (agent_at ?a ?agent_loc)
        (is_cutting_board ?cut-board_loc)
        (not (chopped ?obj)) ; cannot chop if already chopped
        (holding ?a ?obj) ; must be holding the object to chop
        (adjacent ?agent_loc ?cut-board_loc)
        (not (occupied ?cut-board_loc)) ; cannot chop on an occupied cutting board
    )
    :effect
        (chopped ?obj)

)


; --------------------------------------------------------------------------------------------------------------------

; can only pick stuff up if not holding anything
; otherwise puts both objects on shelf

(:action pickup
  :parameters (?a - agent ?agent_loc - cell ?obj_loc - cell ?obj - object)
  :precondition (and
    (agent_at ?a ?agent_loc)
    (object_at ?obj ?obj_loc)
    (adjacent ?agent_loc ?obj_loc)
    (holding_nothing  ?a)
    )
  :effect (and
    (holding ?a ?obj)
    (not (object_at ?obj ?obj_loc))
    (not (holding_nothing  ?a))
    (not (occupied ?obj_loc)) ; mark the cell as not occupied after picking up the object
    )
)



; --------------------------------------------------------------------------------------------------------------------
; delivered objects are removed


(:action deliver
  :parameters (?a - agent ?agent_loc - cell ?delivery_loc - cell ?obj - object)
  :precondition (and
    (agent_at ?a ?agent_loc)
    (holding ?a ?obj )
    (plate ?obj)
    (chopped ?obj)
    (delivery_spot ?delivery_loc)
    (adjacent ?agent_loc ?delivery_loc)
  )
  :effect (and
    (delivered ?obj)
    (not (holding ?a ?obj))
    (holding_nothing ?a)
  )
)


; --------------------------------------------------------------------------------------------------------------------

; when merging items are put down on the shelf
; can merge on cutting board loc
; cannot merge on delivery spot
; for now held object disappears and counter object is changed


(:action merge-plate    ; for putting salad, chopped lettuce, chopped tomato
  :parameters (?a - agent ?agent_loc - cell ?target_loc - cell ?held_obj - object ?counter_obj - object)
  :precondition (and
    (agent_at ?a ?agent_loc)
    (holding ?a ?held_obj)
    (plate ?held_obj)
    (object_at ?counter_obj ?target_loc)
    (adjacent ?agent_loc ?target_loc)
    (chopped ?counter_obj) ; cannot merge plate with tomato/lettuce
    (not (plate ?counter_obj)) ; cannot merge plate with plate
  )
  :effect (and
    (not (holding ?a ?held_obj))
    (plate ?counter_obj)
    (holding ?a ?counter_obj) ; now holding the counter object
    (not (object_at ?counter_obj ?target_loc)) ; remove the counter object from its previous location
  )
)

(:action merge-plate-on-counter    ; for putting salad, chopped lettuce, chopped tomato
  :parameters (?a - agent ?agent_loc - cell ?target_loc - cell ?held_obj - object ?counter_obj - object)
  :precondition (and
    (agent_at ?a ?agent_loc)
    (holding ?a ?held_obj)
    (plate ?counter_obj)
    (object_at ?counter_obj ?target_loc)
    (adjacent ?agent_loc ?target_loc)
    (chopped ?held_obj) ; cannot merge plate with tomato/lettuce
    (not (plate ?held_obj)) ; cannot merge plate with plate
  )
  :effect (and
    (plate ?held_obj)
    (not (object_at ?counter_obj ?target_loc))
  )
)

(:action merge-no-plate ; for putting chopped lettuce with chopped tomato
  :parameters (?a - agent ?agent_loc - cell ?target_loc - cell ?held_obj - object ?counter_obj - object)
  :precondition (and
    (agent_at ?a ?agent_loc)
    (holding ?a ?held_obj)
    (object_at ?counter_obj ?target_loc)
    (adjacent ?agent_loc ?target_loc)
    (chopped ?held_obj) ; cannot merge plate with tomato/lettuce
    (chopped ?counter_obj) ; cannot merge plate with tomato/lettuce
    (not (plate ?held_obj)) ; cannot merge plate with plate
    (not (plate ?counter_obj)) ; cannot merge plate with plate
  )
  :effect (and
    (not (object_at ?counter_obj ?target_loc))
    (tomato ?held_obj)
    (lettuce ?held_obj)
  )
)


; --------------------------------------------------------------------------------------------------------------------


; objects cannot be put down on delivery spot
; objects can be put on chopping board
; can put down any object

(:action put-down
  :parameters (?a - agent ?agent_loc - cell ?target_loc - cell ?obj - object)
  :precondition (and
    (agent_at ?a ?agent_loc)
    (holding ?a ?obj)
    (not (occupied ?target_loc))
    (not (delivery_spot ?target_loc))
    (not (is_floor ?target_loc)) ; cannot put down on floor
    (adjacent ?agent_loc ?target_loc)
  )
  :effect (and
    (not (holding ?a ?obj))
    (object_at ?obj ?target_loc)
    (holding_nothing  ?a)
    (occupied ?target_loc)
  )
)

)

; problem
; PDDL file for open-divider_tl
(define (problem open-divider_tl)
(:domain grid_overcooked)
(:objects
    x0y0 - cell
    x0y1 - cell
    x0y2 - cell
    x0y3 - cell
    x0y4 - cell
    x0y5 - cell
    x0y6 - cell
    x1y0 - cell
    x1y1 - cell
    x1y2 - cell
    x1y3 - cell
    x1y4 - cell
    x1y5 - cell
    x1y6 - cell
    x2y0 - cell
    x2y1 - cell
    x2y2 - cell
    x2y3 - cell
    x2y4 - cell
    x2y5 - cell
    x2y6 - cell
    x3y0 - cell
    x3y1 - cell
    x3y2 - cell
    x3y3 - cell
    x3y4 - cell
    x3y5 - cell
    x3y6 - cell
    x4y0 - cell
    x4y1 - cell
    x4y2 - cell
    x4y3 - cell
    x4y4 - cell
    x4y5 - cell
    x4y6 - cell
    x5y0 - cell
    x5y1 - cell
    x5y2 - cell
    x5y3 - cell
    x5y4 - cell
    x5y5 - cell
    x5y6 - cell
    x6y0 - cell
    x6y1 - cell
    x6y2 - cell
    x6y3 - cell
    x6y4 - cell
    x6y5 - cell
    x6y6 - cell
    a1 - agent
    a2 - agent
    p1 - object
    p2 - object
    l1 - object
    t1 - object
)

(:init
    (agent_at a1 x2y1)
    (holding_nothing a1)
    (occupied x2y1)
    (agent_at a2 x4y1)
    (holding_nothing a2)
    (occupied x4y1)
    (is_cutting_board x0y1)
    (is_cutting_board x0y2)
    (delivery_spot x0y3)
    (is_floor x1y1)
    (not (occupied x1y1))
    (is_floor x1y2)
    (not (occupied x1y2))
    (is_floor x1y3)
    (not (occupied x1y3))
    (is_floor x1y4)
    (not (occupied x1y4))
    (is_floor x1y5)
    (not (occupied x1y5))
    (is_floor x2y1)
    (is_floor x2y2)
    (not (occupied x2y2))
    (is_floor x2y3)
    (not (occupied x2y3))
    (is_floor x2y4)
    (not (occupied x2y4))
    (is_floor x2y5)
    (not (occupied x2y5))
    (is_floor x3y1)
    (not (occupied x3y1))
    (is_floor x3y2)
    (not (occupied x3y2))
    (is_floor x3y3)
    (not (occupied x3y3))
    (is_floor x3y4)
    (not (occupied x3y4))
    (is_floor x3y5)
    (not (occupied x3y5))
    (is_floor x4y1)
    (is_floor x4y2)
    (not (occupied x4y2))
    (is_floor x4y3)
    (not (occupied x4y3))
    (is_floor x4y4)
    (not (occupied x4y4))
    (is_floor x4y5)
    (not (occupied x4y5))
    (object_at t1 x5y0)
    (occupied x5y0)
    (tomato t1)
    (is_floor x5y1)
    (not (occupied x5y1))
    (is_floor x5y2)
    (not (occupied x5y2))
    (is_floor x5y3)
    (not (occupied x5y3))
    (is_floor x5y4)
    (not (occupied x5y4))
    (is_floor x5y5)
    (not (occupied x5y5))
    (object_at p2 x5y6)
    (occupied x5y6)
    (plate p2)
    (object_at l1 x6y1)
    (occupied x6y1)
    (lettuce l1)
    (object_at p1 x6y5)
    (occupied x6y5)
    (plate p1)
    (adjacent x0y0 x1y0)
    (adjacent x1y0 x0y0)
    (adjacent x0y0 x0y1)
    (adjacent x0y1 x0y0)
    (adjacent x0y1 x1y1)
    (adjacent x1y1 x0y1)
    (adjacent x0y1 x0y2)
    (adjacent x0y2 x0y1)
    (adjacent x0y2 x1y2)
    (adjacent x1y2 x0y2)
    (adjacent x0y2 x0y3)
    (adjacent x0y3 x0y2)
    (adjacent x0y3 x1y3)
    (adjacent x1y3 x0y3)
    (adjacent x0y3 x0y4)
    (adjacent x0y4 x0y3)
    (adjacent x0y4 x1y4)
    (adjacent x1y4 x0y4)
    (adjacent x0y4 x0y5)
    (adjacent x0y5 x0y4)
    (adjacent x0y5 x1y5)
    (adjacent x1y5 x0y5)
    (adjacent x0y5 x0y6)
    (adjacent x0y6 x0y5)
    (adjacent x0y6 x1y6)
    (adjacent x1y6 x0y6)
    (adjacent x1y0 x2y0)
    (adjacent x2y0 x1y0)
    (adjacent x1y0 x1y1)
    (adjacent x1y1 x1y0)
    (adjacent x1y1 x2y1)
    (adjacent x2y1 x1y1)
    (adjacent x1y1 x1y2)
    (adjacent x1y2 x1y1)
    (adjacent x1y2 x2y2)
    (adjacent x2y2 x1y2)
    (adjacent x1y2 x1y3)
    (adjacent x1y3 x1y2)
    (adjacent x1y3 x2y3)
    (adjacent x2y3 x1y3)
    (adjacent x1y3 x1y4)
    (adjacent x1y4 x1y3)
    (adjacent x1y4 x2y4)
    (adjacent x2y4 x1y4)
    (adjacent x1y4 x1y5)
    (adjacent x1y5 x1y4)
    (adjacent x1y5 x2y5)
    (adjacent x2y5 x1y5)
    (adjacent x1y5 x1y6)
    (adjacent x1y6 x1y5)
    (adjacent x1y6 x2y6)
    (adjacent x2y6 x1y6)
    (adjacent x2y0 x3y0)
    (adjacent x3y0 x2y0)
    (adjacent x2y0 x2y1)
    (adjacent x2y1 x2y0)
    (adjacent x2y1 x3y1)
    (adjacent x3y1 x2y1)
    (adjacent x2y1 x2y2)
    (adjacent x2y2 x2y1)
    (adjacent x2y2 x3y2)
    (adjacent x3y2 x2y2)
    (adjacent x2y2 x2y3)
    (adjacent x2y3 x2y2)
    (adjacent x2y3 x3y3)
    (adjacent x3y3 x2y3)
    (adjacent x2y3 x2y4)
    (adjacent x2y4 x2y3)
    (adjacent x2y4 x3y4)
    (adjacent x3y4 x2y4)
    (adjacent x2y4 x2y5)
    (adjacent x2y5 x2y4)
    (adjacent x2y5 x3y5)
    (adjacent x3y5 x2y5)
    (adjacent x2y5 x2y6)
    (adjacent x2y6 x2y5)
    (adjacent x2y6 x3y6)
    (adjacent x3y6 x2y6)
    (adjacent x3y0 x4y0)
    (adjacent x4y0 x3y0)
    (adjacent x3y0 x3y1)
    (adjacent x3y1 x3y0)
    (adjacent x3y1 x4y1)
    (adjacent x4y1 x3y1)
    (adjacent x3y1 x3y2)
    (adjacent x3y2 x3y1)
    (adjacent x3y2 x4y2)
    (adjacent x4y2 x3y2)
    (adjacent x3y2 x3y3)
    (adjacent x3y3 x3y2)
    (adjacent x3y3 x4y3)
    (adjacent x4y3 x3y3)
    (adjacent x3y3 x3y4)
    (adjacent x3y4 x3y3)
    (adjacent x3y4 x4y4)
    (adjacent x4y4 x3y4)
    (adjacent x3y4 x3y5)
    (adjacent x3y5 x3y4)
    (adjacent x3y5 x4y5)
    (adjacent x4y5 x3y5)
    (adjacent x3y5 x3y6)
    (adjacent x3y6 x3y5)
    (adjacent x3y6 x4y6)
    (adjacent x4y6 x3y6)
    (adjacent x4y0 x5y0)
    (adjacent x5y0 x4y0)
    (adjacent x4y0 x4y1)
    (adjacent x4y1 x4y0)
    (adjacent x4y1 x5y1)
    (adjacent x5y1 x4y1)
    (adjacent x4y1 x4y2)
    (adjacent x4y2 x4y1)
    (adjacent x4y2 x5y2)
    (adjacent x5y2 x4y2)
    (adjacent x4y2 x4y3)
    (adjacent x4y3 x4y2)
    (adjacent x4y3 x5y3)
    (adjacent x5y3 x4y3)
    (adjacent x4y3 x4y4)
    (adjacent x4y4 x4y3)
    (adjacent x4y4 x5y4)
    (adjacent x5y4 x4y4)
    (adjacent x4y4 x4y5)
    (adjacent x4y5 x4y4)
    (adjacent x4y5 x5y5)
    (adjacent x5y5 x4y5)
    (adjacent x4y5 x4y6)
    (adjacent x4y6 x4y5)
    (adjacent x4y6 x5y6)
    (adjacent x5y6 x4y6)
    (adjacent x5y0 x6y0)
    (adjacent x6y0 x5y0)
    (adjacent x5y0 x5y1)
    (adjacent x5y1 x5y0)
    (adjacent x5y1 x6y1)
    (adjacent x6y1 x5y1)
    (adjacent x5y1 x5y2)
    (adjacent x5y2 x5y1)
    (adjacent x5y2 x6y2)
    (adjacent x6y2 x5y2)
    (adjacent x5y2 x5y3)
    (adjacent x5y3 x5y2)
    (adjacent x5y3 x6y3)
    (adjacent x6y3 x5y3)
    (adjacent x5y3 x5y4)
    (adjacent x5y4 x5y3)
    (adjacent x5y4 x6y4)
    (adjacent x6y4 x5y4)
    (adjacent x5y4 x5y5)
    (adjacent x5y5 x5y4)
    (adjacent x5y5 x6y5)
    (adjacent x6y5 x5y5)
    (adjacent x5y5 x5y6)
    (adjacent x5y6 x5y5)
    (adjacent x5y6 x6y6)
    (adjacent x6y6 x5y6)
    (adjacent x6y0 x6y1)
    (adjacent x6y1 x6y0)
    (adjacent x6y1 x6y2)
    (adjacent x6y2 x6y1)
    (adjacent x6y2 x6y3)
    (adjacent x6y3 x6y2)
    (adjacent x6y3 x6y4)
    (adjacent x6y4 x6y3)
    (adjacent x6y4 x6y5)
    (adjacent x6y5 x6y4)
    (adjacent x6y5 x6y6)
    (adjacent x6y6 x6y5)
)

(:goal
        (and 
             (or 
                 (and 
                     (delivered t1)
                     (tomato t1)
                     (plate t1)
                     (chopped t1)
                 )
                 (and 
                     (delivered p1)
                     (tomato p1)
                     (plate p1)
                     (chopped p1)
                 )
                 (and 
                     (delivered p2)
                     (tomato p2)
                     (plate p2)
                     (chopped p2)
                 )
             )
             (or 
                 (and 
                     (delivered p1)
                     (lettuce p1)
                     (plate p1)
                     (chopped p1)
                 )
                 (and 
                     (delivered p2)
                     (lettuce p2)
                     (plate p2)
                     (chopped p2)
                 )
                 (and 
                     (delivered l1)
                     (lettuce l1)
                     (plate l1)
                     (chopped l1)
                 )
             )
   )
)
)

; plan
1. (move a2 x4y1 x5y1)
   deleted: (agent_at a2 x4y1) (occupied x4y1)
   added: (agent_at a2 x5y1) (occupied x5y1)
   goals met: 0 of 2
2. (move a2 x5y1 x5y2)
   deleted: (agent_at a2 x5y1) (occupied x5y1)
   added: (agent_at a2 x5y2) (occupied x5y2)
   goals met: 0 of 2
3. (move a1 x2y1 x3y1)
   deleted: (agent_at a1 x2y1) (occupied x2y1)
   added: (agent_at a1 x3y1) (occupied x3y1)
   goals met: 0 of 2
4. (move a1 x3y1 x4y1)
   deleted: (agent_at a1 x3y1) (occupied x3y1)
   added: (agent_at a1 x4y1) (occupied x4y1)
   goals met: 0 of 2
5. (move a1 x4y1 x5y1)
   deleted: (agent_at a1 x4y1) (occupied x4y1)
   added: (agent_at a1 x5y1) (occupied x5y1)
   goals met: 0 of 2
6. (pickup a1 x5y1 x6y1 l1)
   deleted: (object_at l1 x6y1) (holding_nothing a1) (occupied x6y1)
   added: (holding a1 l1)
   goals met: 0 of 2
7. (move a1 x5y1 x4y1)
   deleted: (agent_at a1 x5y1) (occupied x5y1)
   added: (agent_at a1 x4y1) (occupied x4y1)
   goals met: 0 of 2
8. (move a2 x5y2 x5y1)
   deleted: (agent_at a2 x5y2) (occupied x5y2)
   added: (agent_at a2 x5y1) (occupied x5y1)
   goals met: 0 of 2
9. (move a1 x4y1 x3y1)
   deleted: (agent_at a1 x4y1) (occupied x4y1)
   added: (agent_at a1 x3y1) (occupied x3y1)
   goals met: 0 of 2
10. (move a1 x3y1 x2y1)
   deleted: (agent_at a1 x3y1) (occupied x3y1)
   added: (agent_at a1 x2y1) (occupied x2y1)
   goals met: 0 of 2
11. (move a1 x2y1 x1y1)
   deleted: (agent_at a1 x2y1) (occupied x2y1)
   added: (agent_at a1 x1y1) (occupied x1y1)
   goals met: 0 of 2
12. (move a1 x1y1 x1y2)
   deleted: (agent_at a1 x1y1) (occupied x1y1)
   added: (agent_at a1 x1y2) (occupied x1y2)
   goals met: 0 of 2
13. (chop a1 x1y2 x0y2 l1)
   added: (chopped l1)
   goals met: 0 of 2
14. (move a1 x1y2 x1y3)
   deleted: (agent_at a1 x1y2) (occupied x1y2)
   added: (agent_at a1 x1y3) (occupied x1y3)
   goals met: 0 of 2
15. (move a1 x1y3 x2y3)
   deleted: (agent_at a1 x1y3) (occupied x1y3)
   added: (agent_at a1 x2y3) (occupied x2y3)
   goals met: 0 of 2
16. (move a1 x2y3 x3y3)
   deleted: (agent_at a1 x2y3) (occupied x2y3)
   added: (agent_at a1 x3y3) (occupied x3y3)
   goals met: 0 of 2
17. (move a1 x3y3 x4y3)
   deleted: (agent_at a1 x3y3) (occupied x3y3)
   added: (agent_at a1 x4y3) (occupied x4y3)
   goals met: 0 of 2
18. (move a1 x4y3 x4y4)
   deleted: (agent_at a1 x4y3) (occupied x4y3)
   added: (agent_at a1 x4y4) (occupied x4y4)
   goals met: 0 of 2
19. (pickup a2 x5y1 x5y0 t1)
   deleted: (object_at t1 x5y0) (holding_nothing a2) (occupied x5y0)
   added: (holding a2 t1)
   goals met: 0 of 2
20. (move a2 x5y1 x4y1)
   deleted: (agent_at a2 x5y1) (occupied x5y1)
   added: (agent_at a2 x4y1) (occupied x4y1)
   goals met: 0 of 2
21. (move a2 x4y1 x3y1)
   deleted: (agent_at a2 x4y1) (occupied x4y1)
   added: (agent_at a2 x3y1) (occupied x3y1)
   goals met: 0 of 2
22. (move a2 x3y1 x2y1)
   deleted: (agent_at a2 x3y1) (occupied x3y1)
   added: (agent_at a2 x2y1) (occupied x2y1)
   goals met: 0 of 2
23. (move a2 x2y1 x1y1)
   deleted: (agent_at a2 x2y1) (occupied x2y1)
   added: (agent_at a2 x1y1) (occupied x1y1)
   goals met: 0 of 2
24. (move a2 x1y1 x1y2)
   deleted: (agent_at a2 x1y1) (occupied x1y1)
   added: (agent_at a2 x1y2) (occupied x1y2)
   goals met: 0 of 2
25. (move a1 x4y4 x5y4)
   deleted: (agent_at a1 x4y4) (occupied x4y4)
   added: (agent_at a1 x5y4) (occupied x5y4)
   goals met: 0 of 2
26. (chop a2 x1y2 x0y2 t1)
   added: (chopped t1)
   goals met: 0 of 2
27. (move a2 x1y2 x1y3)
   deleted: (agent_at a2 x1y2) (occupied x1y2)
   added: (agent_at a2 x1y3) (occupied x1y3)
   goals met: 0 of 2
28. (move a2 x1y3 x2y3)
   deleted: (agent_at a2 x1y3) (occupied x1y3)
   added: (agent_at a2 x2y3) (occupied x2y3)
   goals met: 0 of 2
29. (move a2 x2y3 x3y3)
   deleted: (agent_at a2 x2y3) (occupied x2y3)
   added: (agent_at a2 x3y3) (occupied x3y3)
   goals met: 0 of 2
30. (move a2 x3y3 x3y4)
   deleted: (agent_at a2 x3y3) (occupied x3y3)
   added: (agent_at a2 x3y4) (occupied x3y4)
   goals met: 0 of 2
31. (move a2 x3y4 x4y4)
   deleted: (agent_at a2 x3y4) (occupied x3y4)
   added: (agent_at a2 x4y4) (occupied x4y4)
   goals met: 0 of 2
32. (move a2 x4y4 x4y5)
   deleted: (agent_at a2 x4y4) (occupied x4y4)
   added: (agent_at a2 x4y5) (occupied x4y5)
   goals met: 0 of 2
33. (move a1 x5y4 x5y5)
   deleted: (agent_at a1 x5y4) (occupied x5y4)
   added: (agent_at a1 x5y5) (occupied x5y5)
   goals met: 0 of 2
34. (merge-plate-on-counter a1 x5y5 x6y5 l1 p1)
   deleted: (object_at p1 x6y5)
   added: (plate l1)
   goals met: 0 of 2
35. (move a1 x5y5 x5y4)
   deleted: (agent_at a1 x5y5) (occupied x5y5)
   added: (agent_at a1 x5y4) (occupied x5y4)
   goals met: 0 of 2
36. (move a2 x4y5 x5y5)
   deleted: (agent_at a2 x4y5) (occupied x4y5)
   added: (agent_at a2 x5y5) (occupied x5y5)
   goals met: 0 of 2
37. (move a1 x5y4 x4y4)
   deleted: (agent_at a1 x5y4) (occupied x5y4)
   added: (agent_at a1 x4y4) (occupied x4y4)
   goals met: 0 of 2
38. (move a1 x4y4 x3y4)
   deleted: (agent_at a1 x4y4) (occupied x4y4)
   added: (agent_at a1 x3y4) (occupied x3y4)
   goals met: 0 of 2
39. (move a1 x3y4 x2y4)
   deleted: (agent_at a1 x3y4) (occupied x3y4)
   added: (agent_at a1 x2y4) (occupied x2y4)
   goals met: 0 of 2
40. (move a1 x2y4 x2y3)
   deleted: (agent_at a1 x2y4) (occupied x2y4)
   added: (agent_at a1 x2y3) (occupied x2y3)
   goals met: 0 of 2
41. (merge-plate-on-counter a2 x5y5 x5y6 t1 p2)
   deleted: (object_at p2 x5y6)
   added: (plate t1)
   goals met: 0 of 2
42. (move a2 x5y5 x4y5)
   deleted: (agent_at a2 x5y5) (occupied x5y5)
   added: (agent_at a2 x4y5) (occupied x4y5)
   goals met: 0 of 2
43. (move a2 x4y5 x3y5)
   deleted: (agent_at a2 x4y5) (occupied x4y5)
   added: (agent_at a2 x3y5) (occupied x3y5)
   goals met: 0 of 2
44. (move a2 x3y5 x2y5)
   deleted: (agent_at a2 x3y5) (occupied x3y5)
   added: (agent_at a2 x2y5) (occupied x2y5)
   goals met: 0 of 2
45. (move a2 x2y5 x2y4)
   deleted: (agent_at a2 x2y5) (occupied x2y5)
   added: (agent_at a2 x2y4) (occupied x2y4)
   goals met: 0 of 2
46. (move a2 x2y4 x1y4)
   deleted: (agent_at a2 x2y4) (occupied x2y4)
   added: (agent_at a2 x1y4) (occupied x1y4)
   goals met: 0 of 2
47. (move a1 x2y3 x1y3)
   deleted: (agent_at a1 x2y3) (occupied x2y3)
   added: (agent_at a1 x1y3) (occupied x1y3)
   goals met: 0 of 2
48. (deliver a1 x1y3 x0y3 l1)
   deleted: (holding a1 l1)
   added: (delivered l1) (holding_nothing a1)
   goals met: 1 of 2
49. (move a1 x1y3 x2y3)
   deleted: (agent_at a1 x1y3) (occupied x1y3)
   added: (agent_at a1 x2y3) (occupied x2y3)
   goals met: 1 of 2
50. (move a2 x1y4 x1y3)
   deleted: (agent_at a2 x1y4) (occupied x1y4)
   added: (agent_at a2 x1y3) (occupied x1y3)
   goals met: 1 of 2
51. (deliver a2 x1y3 x0y3 t1)
   deleted: (holding a2 t1)
   added: (delivered t1) (holding_nothing a2)
   goals met: 2 of 2
